In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1= {'Names': ['Aravind','Samar',np.nan,'Siri'],
        'Age':[np.nan,21,32,43],
        'City':['Hyd','Blr','Chennai',np.nan]}

dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [3]:
pd.DataFrame(dict1)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [10]:
d1={'Names': ['Aravind','Samar',np.nan,'Siri'],
        'Age':[np.nan,21,32,43],
        'City':['Hyd','Blr','Chennai',np.nan]}

d1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [13]:
dict2= {'Names':['Aravind','Samar',None,'Siri'],
        'Age':[np.nan,21,32,43],
        'City':['Hyd','Blr','Chennai',None]}

d1=pd.DataFrame(dict2)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  32.0  Chennai
3     Siri  43.0     None

In [16]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

$Method-1$

In [14]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [15]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [17]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan means not a number, it is applicable for numerical columns only

- Generallly, data has some empty rows

- It is a data problem

- If you read that kind of data you will see Null

- So, we need to understand that it is a data corrupted or really Null values are there

**Method-1**

**Fill with some random values**

**Method name**: Fill na

In [18]:
d1.fillna(40)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       40  32.0  Chennai
3     Siri  43.0       40

**Method-2**

- we can fill the values with respect to columns also

In [21]:
d1['Age'].fillna(40)

# it is not updated
# inplace=False
# if we make inplace= True, it will update

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [25]:
d1['Age'].fillna(40,inplace=True)
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2     None  32.0  Chennai
3     Siri  43.0     None

In [28]:
dict1= {'Names': ['Aravind','Samar',np.nan,'Siri'],
        'Age':[np.nan,21,32,43],
        'City':['Hyd','Blr','Chennai',np.nan]}

d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

**Method-3**

- bfill

- ffill

- pad

- backfill

In [30]:
d1.fillna(method='bfill')
# column1: names index 4 is a missing value, it is filled with index 4 value
# column2: Age index 1 is missing value it is filled with index 2 value
# column3: City Index 4 is missing values, it should be filled with next value, but we dont have next value

C:\Users\gunda\AppData\Local\Temp\ipykernel_17640\2561394389.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [31]:
d1.fillna(method='ffill')

C:\Users\gunda\AppData\Local\Temp\ipykernel_17640\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [39]:
d1.fillna(method='pad')

C:\Users\gunda\AppData\Local\Temp\ipykernel_17640\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [36]:
d1.fillna(method='backfill',axis=1)
# axis= means columns
# NAN values fill with next column values

C:\Users\gunda\AppData\Local\Temp\ipykernel_17640\24379084.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill',axis=1)

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0      NaN

- backfill and bfill fill with next value

- pad and ffill fill with previous value

- but it will change based on the axis

**Method-4**

**Mean**

   - Numerical values can fill with mean value

   - but mean affect by outliers

   - if we dont have outliers, it is the best one

**Median**

   - Numericals values can fill with median value

   - but we know median value doesnot affect with outliers

   - if outliers are not there then we can go with median

**Mode**

   - Mode is useful for categorical data

In [42]:
dict1= {'Names': ['Aravind','Samar',np.nan,'Siri'],
        'Age':[np.nan,21,32,43],
        'City':['Hyd','Blr','Chennai',np.nan]}

d1=pd.DataFrame(dict1)

In [43]:
# we already know we can fill with some values based on specific column using fillna
# d1.fillna(<random_number>)
# d1 represents all the columns
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [44]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [ ]:
age_median=d1['City'].median()
d1['City'].fillna(age_median)

- Fill with random value

- Fill with

   - Mean

   - Median

   - mode

**Method-5**

**KNN imputer**

- KNN: K nearest neighbours

- K is a hyper parameter means user can choose

- It is distance metric: **Euclidian distance**

- KNN imputer will take the mean of the neighbours value

- The neighbours value can be provided by using value = k

- It is under the sklearn package

- Under sklearn, we have imputer method

- Under imputer method, we have KNN imputer

- Applicable only for numerical data

<img id="dimg_102" src="" class="YQ4gaf" height="203" style="object-position:41% 16%" width="248" alt="Distance Measures in Machine Learning ..." data-csiid="25" data-atf="5">

In [50]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])